"""
示例 1：

输入：salary = [4000,3000,1000,2000]
输出：2500.00000
解释：最低工资和最高工资分别是 1000 和 4000 。
去掉最低工资和最高工资以后的平均工资是 (2000+3000)/2= 2500
示例 2：

输入：salary = [1000,2000,3000]
输出：2000.00000
解释：最低工资和最高工资分别是 1000 和 3000 。
去掉最低工资和最高工资以后的平均工资是 (2000)/1= 2000
示例 3：

输入：salary = [6000,5000,4000,3000,2000,1000]
输出：3500.00000

"""


def average(salary):
    salary.sort()
    nums = sum(salary) - salary[0] - salary[-1]
    return nums / (len(salary) - 2)


salary = [6000, 5000, 4000, 3000, 2000, 1000]
print(average(salary))
salary1 = [48000, 59000, 99000, 13000, 78000, 45000, 31000, 17000, 39000, 37000, 93000, 77000, 33000, 28000, 4000,
           54000, 67000, 6000, 1000, 11000]
print(average(salary1))

